// lib/consts/building_data.dart

// 전역 변수(const)로 선언하여 어디서든 쓸 수 있게 합니다.
const Map<String, List<Map<String, dynamic>>> buildingData = {
  "하이테크관": [
    {
      'floor': '3F',
      'rooms': ['디지털데이터활용실습실', '강의실 2']
    },
    {
      'floor': '2F',
      'rooms': ['컨퍼런스룸']
    },
  ],
  "1기술관": [
    {
      'floor': '2F',
      'rooms': ['CAD실습실', '콘트롤러실습실']
    },
  ],
  "2기술관": [
    {
      'floor': '3F',
      'rooms': ['자동차과이론강의실', 'PLC실습실']
    },
    {
      'floor': '2F',
      'rooms': ['자동차과이론강의실', 'CAD/CAE실']
    },
    {
      'floor': '1F',
      'rooms': ['CATIA실습실', '전기자동차실습실', '자동차과이론강의실']
    },
  ],
  "3기술관": [
    {
      'floor': '1F',
      'rooms': ['아이디어 존']
    },
  ],
  "5기술관": [
    {
      'floor': '4F',
      'rooms': [
        '시제품창의개발실',
        '아이디어카페',
        '디자인워크샵실습실',
        '융합디자인실습실',
        '디지털디자인실습실',
        '미디어창작실습실'
      ]
    },
    {
      'floor': '3F',
      'rooms': ['강의실', '스터디룸', '반도체제어실', '전자CAD실', '기초전자실습실']
    },
    {
      'floor': '2F',
      'rooms': ['AI융합프로젝트실습실', '인공지능프로그래밍실습실', 'ioT제어실습실']
    },
    {
      'floor': '1F',
      'rooms': ['개인미디어실', '세미나실', '미디어편집실', 'AR그래픽실', '실감형콘텐츠운영실습실']
    },
  ],
  "6기술관": [
    {
      'floor': '1F',
      'rooms': ['건축설계과']
    },
  ],
  "7기술관": [
    {
      'floor': '3F',
      'rooms': ['소그룹실', '강의실', '반도체 시스템 제작실']
    },
  ],
  "대학 본관": [
    {
      'floor': '1F',
      'rooms': ['로비', '행정실']
    },
  ],
};
